Revit 2027 API
BuiltInFailures.GeometryFailures.CurveAndSurfaceDoNotIntersect Property
 Curve and Surface do not intersect.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CurveAndSurfaceDoNotIntersect { get; }
Public Shared ReadOnly Property CurveAndSurfaceDoNotIntersect As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CurveAndSurfaceDoNotIntersect {
	FailureDefinitionId^ get ();
}
static member CurveAndSurfaceDoNotIntersect : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.GeometryFailures Class
Autodesk.Revit.DB Namespace